# Текстовые задачи
# Демонстрирует математические операции

# Выводим задачу на расчет веса бегемота после родов и еды
print("Если беременная самка бегемота массой 800 кг родит детеныша массой 40 кг,")
print("но затем съест 20 кг корма, то сколько она будет после всего этого весить?")

# Ждем нажатия Enter, чтобы пользователь сам решил задачу
input("Чтобы узнать, нажмите Enter.")

# Применяем математические операции для подсчета: 800 - 40 + 20
print("800 - 40 + 20 =", 800 - 40 + 20)

# Задача на подсчет количества пива, купленного студентом
print("\nЕсли студент, возвращаясь с успешно сданного экзамена, на радостях")
print("купил каждому из 6 друзей по 3 бутылки пива, то сколько всего бутылок пива куплено?")

# Ждем нажатия Enter
input("Чтобы узнать, нажмите Enter.")

# Считаем: 6 * 3 — студент купил 6 * 3 = 18 бутылок пива
print("6 * 3 =", 6 * 3)

# Задача на деление счета на четверых
print("\nEсли в ресторане вам с приятелями принесли счет на 19 долларов (считая чаевые),")
print("и вы решили скинуться поровну на четверых, то сколько придется с каждого?")

# Ждем нажатия Enter
input("Чтобы узнать, нажмите Enter.")

# Считаем, сколько с каждого: 19 / 4 — делим сумму на 4 части
print("19 / 4 =", 19 / 4)

# Задача на деление золотых монет среди пиратов
print("\nЕсли четверо пиратов найдут ларчик, в котором ровно 107 золотых монет, и")
print("решат разделить добычу поровну, то сколько целых монет достанется каждому?")

# Ждем нажатия Enter
input("Чтобы узнать, нажмите Enter.")

# Используем операцию целочисленного деления (//), чтобы получить целую часть от деления
print("107 // 4 =", 107 // 4)

# Задача на нахождение оставшихся монет (с остатком от деления)
print("\nЕсли те же самые четверо пиратов разделят те же 107 монет из ларчика поровну.")
print("то сколько останется ничейных монет?")

# Ждем нажатия Enter
input("Чтобы узнать, нажмите Enter.")

# Считаем остаток от деления: 107 % 4 — сколько монет не поделятся поровну
print("107% 4 =", 107 % 4)

# Ждем, пока пользователь нажмёт Enter, чтобы программа не закрылась сразу
input("\n\nНажмите Enter, чтобы выйти.")
